[TC_WOTC_MILL_M4C_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>M4</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>M4</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Базовое оружие"

[TC_WOTC_MILL_M4C_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>Модифицированный M4</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>Модифицированные M4</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни.\nВ процессе модификации карабина M4, нам удалось модифицировать систему отвода пороховых газов Элерием, что дало определенные преимущества над оригиналом. Также большая часть деталей была заменена на детали, изготовленные из инопланетных сплавов, что очень положительно сказалось на эксплуатационных характеристиках оружия в полевых условиях."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Магнитное оружие"

[TC_WOTC_MILL_M4C_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>Карабин XNV4</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>Карабины XNV4</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни.\nГлубокая модернизация карабина M4 затронула не только замену деталей на изготовленные из инопланетных сплавов, что положительно сказалось на долговечности и мощности данного оружия, но и модификацию ствола Элерием, в результате чего удалось невероятно увеличить кинетическую энергию каждой пули, что дало возможность не брать во внимание существующие бронежилеты, в виду их неэффективности перед нашей разработкой."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Лучевое оружие"

[TC_WOTC_SKR_MILL_M4C_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>M4</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>M4s</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Базовое оружие"

[TC_WOTC_SKR_MILL_M4C_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>Модифицированный M4</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>Модифицированные M4</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни.\nВ процессе модификации карабина M4, нам удалось модифицировать систему отвода пороховых газов Элерием, что дало определенные преимущества над оригиналом. Также большая часть деталей была заменена на детали, изготовленные из инопланетных сплавов, что очень положительно сказалось на эксплуатационных характеристиках оружия в полевых условиях."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Магнитное оружие"

[TC_WOTC_SKR_MILL_M4C_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>Карабин XNV4</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>Карабины XNV4</b></font>"
AbilityDescName="автоматический карабин"
BriefSummary="M4A1 - автоматический карабин, созданный в США на основе винтовки М16А2 принятый на вооружение для всех американских сил специальных операций. Данный карабин и его прародитель М16А2 унифицированный на 80%, основными отличиями М4 от М16А2 являются ствол меньшей длины и выдвижной телескопический приклад. Более легкий ствол изготовлен под патрон М855 (SS 109) калибра 5.56x45 мм. Один из режимов стрельбы имеет отсечку по 3 выстрела. В 1996 году по заказу сил специальных операций на основе винтовки М16А3 был разработан аналогичный карабин М4А1, отличавшийся возвратом к полностью автоматическому огню вместо режима огня с отсечкой по 3 выстрела. Тогда же для карабинов М4 и М4А1 был принят базовым вариант со съемной рукояткой для переноски, устанавливающейся на интегральную направляющую типа планки Пикантинни.\nГлубокая модернизация карабина M4 затронула не только замену деталей на изготовленные из инопланетных сплавов, что положительно сказалось на долговечности и мощности данного оружия, но и модификацию ствола Элерием, в результате чего удалось невероятно увеличить кинетическую энергию каждой пули, что дало возможность не брать во внимание существующие бронежилеты, в виду их неэффективности перед нашей разработкой."
TacticalText="<Bullet/>Тип: Автоматический карабин\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: США\n<Bullet/>Уровень технологии: Лучевое оружие"